01  WS-AREA-1 PIC 9(5) VALUE ZEROES. 
01  WS-AREA-2 PIC 9(5) VALUE ZEROES.

PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    IF WS-AREA-1 > 99999 THEN
       DISPLAY "WS-AREA-1 Overflow"
       STOP RUN
    END-IF
    ADD 1 TO WS-AREA-2
    IF WS-AREA-2 > 99999 THEN
       DISPLAY "WS-AREA-2 Overflow"
       STOP RUN
    END-IF
    GO TO PROCEDURE-DIVISION.