01  WS-AREA-1 PIC 9(5) VALUE ZEROES.
01  WS-AREA-2 PIC 9(5) VALUE ZEROES.
01 WS-AREA-3 PIC 9(5) VALUE ZEROES.

PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    IF WS-AREA-1 > 99999 THEN
       MOVE 0 TO WS-AREA-1
       ADD 1 TO WS-AREA-3
    END-IF
    ADD 1 TO WS-AREA-2
    IF WS-AREA-2 > 99999 THEN
       MOVE 0 TO WS-AREA-2
       ADD 1 TO WS-AREA-3
    END-IF
    GO TO PROCEDURE-DIVISION.